In [10]:
import pandas as pd

In [11]:
products = [
            {"Name":"คีย์บอร์ด","Category":"อุปกรณ์คอม","Price":500},
            {"Name":"เมาส์","Category":"อุปกรณ์คอม","Price":300},
            {"Name":"ตุ๊กตา","Category":"ของเล่น","Price":900},
            {"Name":"ทุเรียน","Category":"ผลไม้","Price":70},
            ]

In [12]:
df = pd.DataFrame(products)
df

        Name    Category  Price
0  คีย์บอร์ด  อุปกรณ์คอม    500
1      เมาส์  อุปกรณ์คอม    300
2     ตุ๊กตา     ของเล่น    900
3    ทุเรียน       ผลไม้     70

In [13]:
df.set_index(["Name"],inplace=True)

In [14]:
df

             Category  Price
Name
คีย์บอร์ด  อุปกรณ์คอม    500
เมาส์      อุปกรณ์คอม    300
ตุ๊กตา        ของเล่น    900
ทุเรียน         ผลไม้     70